# A2: P2+P3 with SDA_Fusion + EMA (RFB off).

nc: 80
scales:
  s: [0.50, 0.50, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  - [[0, -1, 2], 1, SDA_Fusion, [[64, 256, 256], 256]]
  - [-1, 2, C3k2, [256, False]]
  - [-1, 1, EMA, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[2, -1, 4], 1, SDA_Fusion, [[256, 256, 512], 256]]
  - [-1, 2, C3k2, [256, False]]
  - [-1, 1, EMA, [256]]

  - [[21, 25], 1, Detect, [nc]]
